yriuss/ATSAM3X8EA-AU-bare-metal/system/sam3x8a.h
/**
******************************************************************************
* @file    stm32f103xb.h
* @author
* @brief   CMSIS Cortex-M3 Device Peripheral Access Layer Header File.
*          This file contains all the peripheral register's definitions, bits
*          definitions and memory mapping for SAM3X devices.
*
*          This file contains:
*           - Data structures and the address mapping for all peripherals
*           - Peripheral's registers declarations and bits definition
*           - Macros to access peripheral's registers hardware
*
******************************************************************************
*/


/** @addtogroup CMSIS
 * @{
 */

#ifndef __SAM3X8A_H
#define __SAM3X8A_H
#ifdef __cplusplus
extern "C" {
#endif
#ifdef FOOL_EMACS
}
#endif

#define BIT0 (1 << 0)
#define BIT1 (1 << 1)
#define BIT2 (1 << 2)
#define BIT3 (1 << 3)
#define BIT4 (1 << 4)
#define BIT5 (1 << 5)
#define BIT6 (1 << 6)
#define BIT7 (1 << 7)
#define BIT8 (1 << 8)
#define BIT9 (1 << 9)
#define BIT10 (1 << 10)
#define BIT11 (1 << 11)
#define BIT12 (1 << 12)
#define BIT13 (1 << 13)
#define BIT14 (1 << 14)
#define BIT15 (1 << 15)
#define BIT16 (1 << 16)
#define BIT17 (1 << 17)
#define BIT18 (1 << 18)
#define BIT19 (1 << 19)
#define BIT20 (1 << 20)
#define BIT21 (1 << 21)
#define BIT22 (1 << 22)
#define BIT23 (1 << 23)
#define BIT24 (1 << 24)
#define BIT25 (1 << 25)
#define BIT26 (1 << 26)
#define BIT27 (1 << 27)
#define BIT28 (1 << 28)
#define BIT29 (1 << 29)
#define BIT30 (1 << 30)
#define BIT31 (1 << 31)


/**
 * @brief Configuration of the Cortex-M3 Processor and Core Peripherals
 */
#define __CM3_REV                  0x0200U  /*!< Core Revision r2p0                           */
#define __MPU_PRESENT              0U       /*!< Other STM32 devices does not provide an MPU  */
#define __NVIC_PRIO_BITS           4U       /*!< STM32 uses 4 Bits for the Priority Levels    */
#define __Vendor_SysTickConfig     0U       /*!< Set to 1 if different SysTick Config is used */




#define IRAM0_ADDR      (0x20000000u) /**< Internal RAM 0 base address */
#define NFC_RAM_ADDR    (0x20100000u) /**< NAND Flash Controller RAM base address */



/**
 * @brief STM32F10x Interrupt Number Definition, according to the selected device
 *        in @ref Library_configuration_section
 */

/*!< Interrupt Number Definition */
/*  */
typedef enum {
              /******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
    NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                             */
    HardFault_IRQn              = -13,    /*!< 3 Cortex-M3 Hard Fault Interrupt                     */
    MemoryManagement_IRQn       = -12,    /*!< 4 Cortex-M3 Memory Management Interrupt              */
    BusFault_IRQn               = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt                      */
    UsageFault_IRQn             = -10,    /*!< 6 Cortex-M3 Usage Fault Interrupt                    */
    SVCall_IRQn                 = -5,     /*!< 11 Cortex-M3 SV Call Interrupt                       */
    DebugMonitor_IRQn           = -4,     /*!< 12 Cortex-M3 Debug Monitor Interrupt                 */
    PendSV_IRQn                 = -2,     /*!< 14 Cortex-M3 Pend SV Interrupt                       */
    SysTick_IRQn                = -1,     /*!< 15 Cortex-M3 System Tick Interrupt                   */

    /******  SAM3X specific Interrupt Numbers ******/
    /******  From page 38 of the datasheet    ******/
    SUPC_IRQn                   = 0,
    RSTC_IRQn                   = 1,
    RTC_IRQn                    = 2,
    RTT_IRQn                    = 3,
    WDG_IRQn                    = 4,
    PMC_IRQn                    = 5,
    EEFC0_IRQn                  = 6,
    EEFC1_IRQn                  = 7,
    UART_IRQn                   = 8,
#if 0
    _IRQn                   = 9,
    _IRQn                   = 10,
#endif
    PIOA_IRQn                   = 11,
    PIOB_IRQn                   = 12,
    PIOC_IRQn                   = 13,
    PIOD_IRQn                   = 14,
    PIOE_IRQn                   = 15,
    PIOF_IRQn                   = 16,
    USART0_IRQn                 = 17,
    USART1_IRQn                 = 18,
    USART2_IRQn                 = 19,
    USART3_IRQn                 = 20,
#if 0
    _IRQn                   = 21,
    _IRQn                   = 22,
    _IRQn                   = 23,
    _IRQn                   = 24,
    _IRQn                   = 25,
    _IRQn                   = 26,
    _IRQn                   = 27,
    _IRQn                   = 28,
    _IRQn                   = 29,
    _IRQn                   = 30,
    _IRQn                   = 31,
    _IRQn                   = 32,
    _IRQn                   = 33,
    _IRQn                   = 34,
    _IRQn                   = 35,
    _IRQn                   = 36,
#endif
    ADC_IRQn                = 37,
#if 0
    _IRQn                   = 38,
    _IRQn                   = 39,
    _IRQn                   = 40,
    _IRQn                   = 41,
    _IRQn                   = 42,
    _IRQn                   = 43,
    _IRQn                   = 44,
#endif
} IRQn_Type;

    /**
     * @}
     */

#include "core_cm3.h"
#include <stdint.h>

typedef volatile uint32_t RoReg; /**< Read only 32-bit register */
typedef volatile uint32_t WoReg; /**< Write only 32-bit register */
typedef volatile uint32_t RwReg; /**< Read-Write 32-bit register */

typedef struct {
    RwReg EEFC_FMR; /**< \brief (Efc Offset: 0x00) EEFC Flash Mode Register */
    WoReg EEFC_FCR; /**< \brief (Efc Offset: 0x04) EEFC Flash Command Register */
    RoReg EEFC_FSR; /**< \brief (Efc Offset: 0x08) EEFC Flash Status Register */
    RoReg EEFC_FRR; /**< \brief (Efc Offset: 0x0C) EEFC Flash Result Register */
} Efc_TypeDef;

typedef struct {
    WoReg PMC_SCER;      /**< \brief (Pmc Offset: 0x0000) System Clock Enable Register */
    WoReg PMC_SCDR;      /**< \brief (Pmc Offset: 0x0004) System Clock Disable Register */
    RoReg PMC_SCSR;      /**< \brief (Pmc Offset: 0x0008) System Clock Status Register */
    RoReg Reserved1[1];
    WoReg PMC_PCER0;     /**< \brief (Pmc Offset: 0x0010) Peripheral Clock Enable Register 0 */
    WoReg PMC_PCDR0;     /**< \brief (Pmc Offset: 0x0014) Peripheral Clock Disable Register 0 */
    RoReg PMC_PCSR0;     /**< \brief (Pmc Offset: 0x0018) Peripheral Clock Status Register 0 */
    RwReg CKGR_UCKR;     /**< \brief (Pmc Offset: 0x001C) UTMI Clock Register */
    RwReg CKGR_MOR;      /**< \brief (Pmc Offset: 0x0020) Main Oscillator Register */
    RoReg CKGR_MCFR;     /**< \brief (Pmc Offset: 0x0024) Main Clock Frequency Register */
    RwReg CKGR_PLLAR;    /**< \brief (Pmc Offset: 0x0028) PLLA Register */
    RoReg Reserved2[1];
    RwReg PMC_MCKR;      /**< \brief (Pmc Offset: 0x0030) Master Clock Register */
    RoReg Reserved3[1];
    RwReg PMC_USB;       /**< \brief (Pmc Offset: 0x0038) USB Clock Register */
    RoReg Reserved4[1];
    RwReg PMC_PCK[3];    /**< \brief (Pmc Offset: 0x0040) Programmable Clock 0 Register */
    RoReg Reserved5[5];
    WoReg PMC_IER;       /**< \brief (Pmc Offset: 0x0060) Interrupt Enable Register */
    WoReg PMC_IDR;       /**< \brief (Pmc Offset: 0x0064) Interrupt Disable Register */
    RoReg PMC_SR;        /**< \brief (Pmc Offset: 0x0068) Status Register */
    RoReg PMC_IMR;       /**< \brief (Pmc Offset: 0x006C) Interrupt Mask Register */
    RwReg PMC_FSMR;      /**< \brief (Pmc Offset: 0x0070) Fast Startup Mode Register */
    RwReg PMC_FSPR;      /**< \brief (Pmc Offset: 0x0074) Fast Startup Polarity Register */
    WoReg PMC_FOCR;      /**< \brief (Pmc Offset: 0x0078) Fault Output Clear Register */
    RoReg Reserved6[26];
    RwReg PMC_WPMR;      /**< \brief (Pmc Offset: 0x00E4) Write Protect Mode Register */
    RoReg PMC_WPSR;      /**< \brief (Pmc Offset: 0x00E8) Write Protect Status Register */
    RoReg Reserved7[5];
    WoReg PMC_PCER1;     /**< \brief (Pmc Offset: 0x0100) Peripheral Clock Enable Register 1 */
    WoReg PMC_PCDR1;     /**< \brief (Pmc Offset: 0x0104) Peripheral Clock Disable Register 1 */
    RoReg PMC_PCSR1;     /**< \brief (Pmc Offset: 0x0108) Peripheral Clock Status Register 1 */
    RwReg PMC_PCR;       /**< \brief (Pmc Offset: 0x010C) Peripheral Control Register */
} Pmc_TypeDef;


/**
 * @brief General Purpose I/O
 */
typedef struct {
    WoReg PER;       
    WoReg PDR;       
    RoReg PSR;       
    RoReg reserved1;
    WoReg OER;       
    WoReg ODR;       
    RoReg OSR;       
    RoReg reserved2;
    WoReg IFER;      
    WoReg IFDR;      
    RoReg IFSR;      
    RoReg reserved3;
    WoReg SODR;      
    WoReg CODR;      
    RwReg ODSR;      
    RoReg PDSR;      
    WoReg IER;       
    WoReg IDR;       
    RoReg IMR;       
    RoReg ISR;       
    WoReg MDER;      
    WoReg MDDR;      
    RoReg MDSR;      
    RoReg reserved4;
    WoReg PUDR;      
    WoReg PUER;      
    RoReg PUSR;      
    RoReg reserved5;
    RwReg ABSR;      
    RoReg reserved6[3];
    WoReg SCIFSR;    
    WoReg DIFSR;     
    RoReg IFDGSR;    
    RwReg SCDR;      
    RoReg reserved7[4];
    WoReg OWER;      
    WoReg OWDR;      
    RoReg OWSR;      
    RoReg reserved8;
    WoReg AIMER;     
    WoReg AIMDR;     
    RoReg AIMMR;     
    RoReg reserved9;
    WoReg ESR;       
    WoReg LSR;       
    RoReg ELSR;      
    RoReg reserved10;
    WoReg FELLSR;    
    WoReg REHLSR;    
    RoReg FRLHSR;    
    RoReg reserved11;
    RoReg LOCKSR;    
    RwReg WPMR;
    RoReg WPSR;
} GPIO_TypeDef;

