yriuss/ATSAM3X8EA-AU-bare-metal/system/sam3x8a.h
typedef struct {
  WoReg WDT_CR; /**< \brief (Wdt Offset: 0x00) Control Register */
  RwReg WDT_MR; /**< \brief (Wdt Offset: 0x04) Mode Register */
  RoReg WDT_SR; /**< \brief (Wdt Offset: 0x08) Status Register */
} Wdt_TypeDef;


typedef struct {
    WoReg CR;
    RwReg MR;
    WoReg IER;
    WoReg IDR;
    RoReg IMR;
    RoReg SR;
    RoReg RHR;
    WoReg THR;
    RwReg BRGR;
} UART_TypeDef;

typedef struct {
    WoReg CR;
    RwReg MR;
    RwReg SEQR1;
    RwReg SEQR2;
    WoReg CHER;
    WoReg CHDR;
    RoReg CHSR;
    RoReg Reserved1;
    RoReg LCDR;
    WoReg IER;
    WoReg IDR;
    RoReg IMR;
    RoReg ISR;
    RoReg Reserved2;
    RoReg Reserved3;
    RoReg OVER;
    RwReg EMR;
    RwReg CWR;
    RwReg CGR;
    RwReg COR;
    RoReg CDR[16];
    RoReg Reserved4;
    RwReg ACR;
    RoReg Reserved5[11];
    RoReg Reserved6[8];
    RwReg WPMR;
    RoReg WPSR;
} ADC_TypeDef;


/* */
#define PMC   ((Pmc_TypeDef *)0x400E0600U) /**< \brief (PMC       ) Base Address */
#define EFC0  ((Efc_TypeDef *)0x400E0A00U) /**< \brief (EFC0      ) Base Address */
#define EFC1  ((Efc_TypeDef *)0x400E0C00U) /**< \brief (EFC1      ) Base Address */
#define WDT   ((Wdt_TypeDef *)0x400E1A50U) /**< \brief (WDT       ) Base Address */
#define GPIOA ((GPIO_TypeDef *) 0x400E0E00U)
#define GPIOB ((GPIO_TypeDef *) 0x400E1000U)
#define GPIOC ((GPIO_TypeDef *) 0x400E1200U)
#define GPIOD ((GPIO_TypeDef *) 0x400E1400U)
#define UART  ((UART_TypeDef *) 0x400E0800U)
/* TODO: Implement USART structure. For now, using the UART
   structure */
#define USART0 ((UART_TypeDef *) 0x40098000U)
#define USART1 ((UART_TypeDef *) 0x4009C000U)
#define USART2 ((UART_TypeDef *) 0x400A0000U)
#define USART3 ((UART_TypeDef *) 0x400A4000U)
#define ADC    ((ADC_TypeDef *)  0x400C0000U)


#define EEFC_FMR_FWS_Pos 8
#define EEFC_FMR_FWS_Msk (0xfu << EEFC_FMR_FWS_Pos) /**< \brief (EEFC_FMR) Flash Wait State */
#define EEFC_FMR_FWS(value) ((EEFC_FMR_FWS_Msk & ((value) << EEFC_FMR_FWS_Pos)))

#define CKGR_MOR_MOSCXTEN (0x1u << 0) /**< \brief (CKGR_MOR) Main Crystal Oscillator Enable */
#define CKGR_MOR_MOSCXTBY (0x1u << 1) /**< \brief (CKGR_MOR) Main Crystal Oscillator Bypass */
#define CKGR_MOR_MOSCRCEN (0x1u << 3) /**< \brief (CKGR_MOR) Main On-Chip RC Oscillator Enable */
#define CKGR_MOR_MOSCRCF_Pos 4
#define CKGR_MOR_MOSCRCF_Msk (0x7u << CKGR_MOR_MOSCRCF_Pos) /**< \brief (CKGR_MOR) Main On-Chip RC Oscillator Frequency Selection */
#define CKGR_MOR_MOSCRCF_4_MHz (0x0u << CKGR_MOR_MOSCRCF_Pos) /**< \brief (CKGR_MOR) The Fast RC Oscillator Frequency is at 4 MHz (default) */
#define CKGR_MOR_MOSCRCF_8_MHz (0x1u << CKGR_MOR_MOSCRCF_Pos) /**< \brief (CKGR_MOR) The Fast RC Oscillator Frequency is at 8 MHz */
#define CKGR_MOR_MOSCRCF_12_MHz (0x2u << CKGR_MOR_MOSCRCF_Pos) /**< \brief (CKGR_MOR) The Fast RC Oscillator Frequency is at 12 MHz */
#define CKGR_MOR_MOSCXTST_Pos 8
#define CKGR_MOR_MOSCXTST_Msk (0xffu << CKGR_MOR_MOSCXTST_Pos) /**< \brief (CKGR_MOR) Main Crystal Oscillator Start-up Time */
#define CKGR_MOR_MOSCXTST(value) ((CKGR_MOR_MOSCXTST_Msk & ((value) << CKGR_MOR_MOSCXTST_Pos)))
#define CKGR_MOR_KEY_Pos 16
#define CKGR_MOR_KEY_Msk (0xffu << CKGR_MOR_KEY_Pos) /**< \brief (CKGR_MOR) Password */
#define CKGR_MOR_KEY(value) ((CKGR_MOR_KEY_Msk & ((value) << CKGR_MOR_KEY_Pos)))
#define CKGR_MOR_MOSCSEL (0x1u << 24) /**< \brief (CKGR_MOR) Main Oscillator Selection */
#define CKGR_MOR_CFDEN (0x1u << 25) /**< \brief (CKGR_MOR) Clock Failure Detector Enable */
#define CKGR_MOR_KEY_VALUE (0X37)

#define SYS_CKGR_MOR_KEY_VALUE	CKGR_MOR_KEY(0x37UL)
#define PMC_SR_MOSCSELS_Pos 16
#define PMC_SR_MOSCSELS (0x1u << PMC_SR_MOSCSELS_Pos)
#define PMC_SR_MOSCRCS_Pos 17
#define PMC_SR_MOSCRCS (0x1u << PMC_SR_MOSCRCS_Pos)
#define PMC_SR_MCKRDY_Pos 3
#define PMC_SR_MCKRDY (0x1u << PMC_SR_MCKRDY_Pos)
#define PMC_PCER0_UART   (1U << UART_IRQn)
#define PMC_PCER0_USART0 (1U << USART0_IRQn)
#define PMC_PCER0_USART1 (1U << USART1_IRQn)
#define PMC_PCER0_USART2 (1U << USART2_IRQn)
#define PMC_PCER0_USART3 (1U << USART3_IRQn)
#define PMC_PCER0_PIOA   (1U << PIOA_IRQn)
#define PMC_PCER0_PIOB   (1U << PIOB_IRQn)
#define PMC_PCER0_PIOC   (1U << PIOC_IRQn)
#define PMC_PCER0_PIOD   (1U << PIOD_IRQn)
#define PMC_PCER1_ADC    (1U << (ADC_IRQn - 32))

#define PMC_PCDR1_ADC    (1U << (ADC_IRQn - 32))

#define CKGR_PLLAR_ONE (0x1u << 29)

#define CKGR_PLLAR_DIVA_Pos 0
#define CKGR_PLLAR_DIVA_Msk (0xffu << CKGR_PLLAR_DIVA_Pos) /**< \brief (CKGR_PLLAR) Divider */
#define CKGR_PLLAR_DIVA(value) ((CKGR_PLLAR_DIVA_Msk & ((value) << CKGR_PLLAR_DIVA_Pos)))
#define CKGR_PLLAR_PLLACOUNT_Pos 8
#define CKGR_PLLAR_PLLACOUNT_Msk (0x3fu << CKGR_PLLAR_PLLACOUNT_Pos) /**< \brief (CKGR_PLLAR) PLLA Counter */
#define CKGR_PLLAR_PLLACOUNT(value) ((CKGR_PLLAR_PLLACOUNT_Msk & ((value) << CKGR_PLLAR_PLLACOUNT_Pos)))
#define CKGR_PLLAR_MULA_Pos 16
#define CKGR_PLLAR_MULA_Msk (0x7ffu << CKGR_PLLAR_MULA_Pos) /**< \brief (CKGR_PLLAR) PLLA Multiplier */
#define CKGR_PLLAR_MULA(value) ((CKGR_PLLAR_MULA_Msk & ((value) << CKGR_PLLAR_MULA_Pos)))
#define CKGR_PLLAR_ONE (0x1u << 29) /**< \brief (CKGR_PLLAR) Must Be Set to 1 */


#define SYS_BOARD_PLLAR (CKGR_PLLAR_ONE                                 \
                         | CKGR_PLLAR_MULA(0x6UL)                       \
                         | CKGR_PLLAR_PLLACOUNT(0x3fUL)                 \
                         | CKGR_PLLAR_DIVA(0x1UL))
                            
#define PMC_MCKR_PRES_Pos 4
#define PMC_MCKR_PRES_Msk (0x7 << PMC_MCKR_PRES_Pos)
#define PMC_MCKR_PRES_CLK_1 0
#define PMC_MCKR_PRES_CLK_2 (0x1u << PMC_MCKR_PRES_Pos)
#define PMC_MCKR_PRES_CLK_4 (0x2u << PMC_MCKR_PRES_Pos)
#define PMC_MCKR_PRES_CLK_8 (0x3u << PMC_MCKR_PRES_Pos)
#define PMC_MCKR_PRES_CLK_16 (0x4u << PMC_MCKR_PRES_Pos)
#define PMC_MCKR_PRES_CLK_32 (0x5u << PMC_MCKR_PRES_Pos)
#define PMC_MCKR_PRES_CLK_64 (0x6u << PMC_MCKR_PRES_Pos)
#define PMC_MCKR_PRES_CLK_3 (0x7u << PMC_MCKR_PRES_Pos)

#define PMC_MCKR_CSS_PLLA_CLK (0x2u << 0)
#define SYS_BOARD_MCKR      (PMC_MCKR_PRES_CLK_1 | PMC_MCKR_CSS_PLLA_CLK)
#define SYS_BOARD_OSCOUNT   (CKGR_MOR_MOSCXTST(0x8))

#define PMC_MCKR_CSS_Pos 0
#define PMC_MCKR_CSS_Msk (0x3 << PMC_MCKR_CSS_Pos)
#define PMC_MCKR_CSS_MAIN_CLK (0x1 << PMC_MCKR_CSS_Pos)
#define PMC_SR_MOSCXTS (0x1u << 0)
#define PMC_SR_LOCKA (0x1u << 1)

#define WDT_MR_WDV_Pos 0
#define WDT_MR_WDV_Msk (0xFFFUL << WDT_MR_WDV_Pos)
#define WDT_MR_WDFIEN_Pos 12
#define WDT_MR_WDFIEN     (1UL << WDT_MR_WDFIEN_Pos)
#define WDT_MR_WDFIEN_Msk WDT_MR_WDFIEN
#define WDT_MR_WDRSTEN_Pos 13
#define WDT_MR_WDRSTEN     (1UL << WDT_MR_WDRSTEN_Pos)
#define WDT_MR_WDRSTEN_Msk WDT_MR_WDRSTEN
#define WDT_MR_WDRPROC_Pos 14
#define WDT_MR_WDRPROC     (1UL << WDT_MR_WDRPROC_Pos)
#define WDT_MR_WDRPROC_Msk WDT_MR_WDRPROC
#define WDT_MR_WDDIS_Pos 15
#define WDT_MR_WDDIS     (1UL << WDT_MR_WDDIS_Pos)
#define WDT_MR_WDDIS_Msk WDT_MR_WDDIS
#define WDT_MR_WDD_Pos 16
#define WDT_MR_WDD_Msk (0xFFFUL << WDT_MR_WDD_Pos)
#define WDT_MR_WDDBGHLT_Pos 28
#define WDT_MR_WDDBGHLT     (1UL << WDT_MR_WDDBGHLT_Pos)
#define WDT_MR_WDDBGHLT_Msk WDT_MR_WDDBGHLT
#define WDT_MR_WDIDLEHLT_Pos 29
#define WDT_MR_WDIDLEHLT     (1UL << WDT_MR_WDIDLEHLT_Pos)
#define WDT_MR_WDIDLEHLT_Msk WDT_MR_WDIDLEHLT

#define UART_CR_RSTRX_Pos  2
#define UART_CR_RSTRX      (1U << UART_CR_RSTRX_Pos)
#define UART_CR_RSTTX_Pos  3
#define UART_CR_RSTTX      (1U << UART_CR_RSTTX_Pos)
#define UART_CR_RXEN_Pos   4
#define UART_CR_RXEN       (1U << UART_CR_RXEN_Pos)
#define UART_CR_RXDIS_Pos  5
#define UART_CR_RXDIS      (1U << UART_CR_RXDIS_Pos)
#define UART_CR_TXEN_Pos   6
#define UART_CR_TXEN       (1U << UART_CR_TXEN_Pos)
#define UART_CR_TXDIS_Pos  7
#define UART_CR_TXDIS      (1U << UART_CR_TXDIS_Pos)
#define UART_CR_RSTSTA_Pos 8
#define UART_CR_RSTSTA     (1U << UART_CR_RSTSTA_Pos)

#define UART_MR_PAR_Pos 9
#define UART_MR_PAR_Msk   (0X7U << UART_MR_PAR_Pos)
#define UART_MR_EVEN_PAR  (0X0U << UART_MR_PAR_Pos)
#define UART_MR_ODD_PAR   (0X1U << UART_MR_PAR_Pos)
#define UART_MR_SPACE_PAR (0X2U << UART_MR_PAR_Pos)
#define UART_MR_MARK_PAR  (0X3U << UART_MR_PAR_Pos)
#define UART_MR_NO_PAR    (0X4U << UART_MR_PAR_Pos)
#define UART_MR_CHMODE_Pos 14
#define UART_MR_CHMODE_Msk         (0x3U << UART_MR_CHMODE_Pos)
#define UART_MR_CHMODE_NORMAL      (0x0U << UART_MR_CHMODE_Pos)
#define UART_MR_CHMODE_AUTO        (0x1U << UART_MR_CHMODE_Pos)
#define UART_MR_CHMODE_LOCAL_LOOP  (0x2U << UART_MR_CHMODE_Pos)
#define UART_MR_CHMODE_REMOTE_LOOP (0x3U << UART_MR_CHMODE_Pos)
#define UART_IMR_RXRDY_Pos   0
#define UART_IMR_RXRDY       (1U << UART_IMR_RXRDY_Pos)
#define UART_IMR_TXRDY_Pos   1
#define UART_IMR_TXRDY       (1U << UART_IMR_TXRDY_Pos)
#define UART_IMR_ENDRX_Pos   3
#define UART_IMR_ENDRX       (1U << UART_IMR_ENDRX_Pos)
#define UART_IMR_ENDTX_Pos   4
#define UART_IMR_ENDTX       (1U << UART_IMR_ENDTX_Pos)
#define UART_IMR_OVRE_Pos    5
#define UART_IMR_OVRE        (1U << UART_IMR_OVRE_Pos)
#define UART_IMR_FRAME_Pos   6
#define UART_IMR_FRAME       (1U << UART_IMR_FRAME_Pos)
#define UART_IMR_PARE_Pos    7
#define UART_IMR_PARE        (1U << UART_IMR_PARE_Pos)
#define UART_IMR_TXEMPTY_Pos 9
#define UART_IMR_TXEMPTY     (1U << UART_IMR_TXEMPTY_Pos)
#define UART_IMR_TXBUFE_Pos  11
#define UART_IMR_TXBUFE      (1U << UART_IMR_TXBUFE_Pos)
#define UART_IMR_RXBUFF_Pos  12
#define UART_IMR_RXBUFF      (1U << UART_IMR_RXBUFF_Pos)
#define UART_SR_RXRDY    UART_IMR_RXRDY
#define UART_SR_TXRDY    UART_IMR_TXRDY
#define UART_SR_ENDRX    UART_IMR_ENDRX
#define UART_SR_ENDTX    UART_IMR_ENDTX
#define UART_SR_OVRE     UART_IMR_OVRE
#define UART_SR_FRAME    UART_IMR_FRAME
#define UART_SR_PARE     UART_IMR_PARE
#define UART_SR_TXEMPTY  UART_IMR_TXEMPTY
#define UART_SR_TXBUFE   UART_IMR_TXBUFE
#define UART_SR_RXBUFF   UART_IMR_RXBUFF

