yriuss/ATSAM3X8EA-AU-bare-metal/system/sam3x8a.h
#define ADC_CR_SWRST_Pos  0   
#define ADC_CR_SWRST      (1 << ADC_CR_SWRST_Pos)
#define ADC_CR_START_Pos  1   
#define ADC_CR_START      (1 << ADC_CR_START_Pos)
#define ADC_MR_TRGEN_Pos  0
#define ADC_MR_TRGEN      (1 << ADC_MR_TRGEN_Pos)
#define ADC_MR_TRGSEL_Pos 1
#define ADC_MR_TRGSEL_Msk (0x7 << ADC_MR_TRGSEL_Pos)
#define ADC_MR_TRGSEL_TRIG0 (0x0 << ADC_MR_TRGSEL_Pos)
#define ADC_MR_TRGSEL_TRIG1 (0x1 << ADC_MR_TRGSEL_Pos)
#define ADC_MR_TRGSEL_TRIG2 (0x2 << ADC_MR_TRGSEL_Pos)
#define ADC_MR_TRGSEL_TRIG3 (0x3 << ADC_MR_TRGSEL_Pos)
#define ADC_MR_TRGSEL_TRIG4 (0x4 << ADC_MR_TRGSEL_Pos)
#define ADC_MR_TRGSEL_TRIG5 (0x5 << ADC_MR_TRGSEL_Pos)
#define ADC_MR_TRGSEL_ADCTRG ADC_MR_TRGSEL_TRIG0
#define ADC_MR_TRGSEL_TIOA0  ADC_MR_TRGSEL_TRIG1
#define ADC_MR_TRGSEL_TIOA1  ADC_MR_TRGSEL_TRIG2
#define ADC_MR_TRGSEL_TIOA2  ADC_MR_TRGSEL_TRIG3
#define ADC_MR_TRGSEL_PWM0   ADC_MR_TRGSEL_TRIG4
#define ADC_MR_TRGSEL_PWM1   ADC_MR_TRGSEL_TRIG5
#define ADC_MR_LOWRES_Pos 4
#define ADC_MR_LOWRES     (1 << ADC_MR_LOWRES_Pos)
#define ADC_MR_SLEEP_Pos  5
#define ADC_MR_SLEEP      (1 << ADC_MR_SLEEP_Pos)
#define ADC_MR_FWUP_Pos   6
#define ADC_MR_FWUP       (1 << ADC_MR_FWUP_Pos)
#define ADC_MR_FREERUN_Pos 7
#define ADC_MR_FREERUN     (1 << ADC_MR_FREERUN_Pos)
#define ADC_MR_PRESCAL_Pos 8
#define ADC_MR_PRESCAL_Msk (0xFF << ADC_MR_PRESCAL_Pos)
#define ADC_MR_STARTUP_Pos 16
#define ADC_MR_STARTUP_Msk (0xF << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT0 (0x0 << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT8 (0x1 << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT16 (0x2 << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT24 (0x3 << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT64 (0x4 << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT80 (0x5 << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT96 (0x6 << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT112 (0x7 << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT512 (0x8 << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT576 (0x9 << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT640 (0xA << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT704 (0xB << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT768 (0xC << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT832 (0xD << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT896 (0xE << ADC_MR_STARTUP_Pos)
#define ADC_MR_STARTUP_SUT960 (0xF << ADC_MR_STARTUP_Pos)
#define ADC_MR_SETTLING_Pos 20
#define ADC_MR_SETTLING_Msk (0x3 << ADC_MR_SETTLING_Pos)
#define ADC_MR_SETTLING_AST3 (0x0 << ADC_MR_SETTLING_Pos)
#define ADC_MR_SETTLING_AST5 (0x1 << ADC_MR_SETTLING_Pos)
#define ADC_MR_SETTLING_AST9 (0x2 << ADC_MR_SETTLING_Pos)
#define ADC_MR_SETTLING_AST17 (0x3 << ADC_MR_SETTLING_Pos)
#define ADC_MR_ANACH_Pos  23
#define ADC_MR_ANACH      (1 << ADC_MR_ANACH_Pos)
#define ADC_MR_TRACKTIM_Pos 24
#define ADC_MR_TRACKTIM_Msk (0x7 << ADC_MR_TRACKTIM_Pos)
#define ADC_MR_TRANSFER_Pos 28
#define ADC_MR_TRANSFER_Msk (0x7 << ADC_MR_TRANSFER_Pos)
#define ADC_MR_USEQ_Pos    31
#define ADC_MR_USEQ        (1 << ADC_MR_USEQ_Pos)
#define ADC_SEQR_USCH_Msk  0xF
#define ADC_LCDR_LDATA_Pos 0
#define ADC_LCDR_LDATA_Msk (0xFFF << ADC_LCDR_LDATA_Pos)
#define ADC_LCDR_CHNB_Pos  12
#define ADC_LCDR_CHNB_Msk  (0xF << ADC_LCDR_CHNB_Pos)
#define ADC_IER_DRDY_Pos   24
#define ADC_IER_DRDY       (1 << ADC_IER_DRDY_Pos)
#define ADC_IER_GOVRE_Pos  25
#define ADC_IER_GOVRE      (1 << ADC_IER_GOVRE_Pos)
#define ADC_IER_COMPE_Pos  26
#define ADC_IER_COMPE      (1 << ADC_IER_COMPE_Pos)
#define ADC_IER_ENDRX_Pos  27
#define ADC_IER_ENDRX      (1 << ADC_IER_ENDRX_Pos)
#define ADC_IER_RXBUF_Pos  28
#define ADC_IER_RXBUF      (1 << ADC_IER_RXBUF_Pos)
#define ADC_IDR_DRDY       ADC_IER_DRDY
#define ADC_IDR_GOVRE      ADC_IER_GOVRE
#define ADC_IDR_COMPE      ADC_IER_COMPE
#define ADC_IDR_ENDRX      ADC_IER_ENDRX
#define ADC_IDR_RXBUF      ADC_IER_RXBUF
#define ADC_IMR_DRDY       ADC_IER_DRDY
#define ADC_IMR_GOVRE      ADC_IER_GOVRE
#define ADC_IMR_COMPE      ADC_IER_COMPE
#define ADC_IMR_ENDRX      ADC_IER_ENDRX
#define ADC_IMR_RXBUF      ADC_IER_RXBUF
#define ADC_ISR_DRDY       ADC_IER_DRDY
#define ADC_ISR_GOVRE      ADC_IER_GOVRE
#define ADC_ISR_COMPE      ADC_IER_COMPE
#define ADC_ISR_ENDRX      ADC_IER_ENDRX
#define ADC_ISR_RXBUF      ADC_IER_RXBUF
/* TODO: the constants related to the registers EMR, CGR, WPMR and
   WPSR below still need to be defined */
#define ADC_EMR__Pos 24
#define ADC_EMR__Msk (0x7 << ADC_MR__Pos)
/* End of TODO */
#define ADC_CDR_DATA_Pos  0
#define ADC_CDR_DATA_Msk  (0xFFF << ADC_CDR_DATA_Pos)
#define ADC_ACR_TSON_Pos  4
#define ADC_ACR_TSON      (1 << ADC_ACR_TSON_Pos)
#define ADC_ACR_IBCTL_Pos 8
#define ADC_ACR_IBCTL_Msk (0x3 << ADC_ACR_IBCTL_Pos)

#define code_adc_mr_settling(n) (((n) << ADC_MR_SETTLING_Pos) & \
                                 ADC_MR_SETTLING_Msk)
#define code_adc_mr_tracking(n) (((n) << ADC_MR_TRACKTIM_Pos) & \
                                 ADC_MR_TRACKTIM_Msk)
#define code_adc_mr_transfer(n) (((n) << ADC_MR_TRANSFER_Pos) & \
                                 ADC_MR_TRANSFER_Msk)
#define code_adc_mr_startup(n)  (((n) << ADC_MR_STARTUP_Pos) &  \
                                 ADC_MR_STARTUP_Msk)
#define code_adc_mr_prescaler(n) (((n) << ADC_MR_PRESCAL_Pos) & \
                                  ADC_MR_PRESCAL_Msk)


#if 0
    /**
     * @brief DMA Controller
     */

#define DMA_NBR_CHANNELS 7

typedef struct {
    uint32_t CCR;
    uint32_t CNDTR;
    uint32_t CPAR;
    uint32_t CMAR;
    uint32_t reserved;
} DMA_Channel_TypeDef;

typedef struct {
    uint32_t ISR;
    uint32_t IFCR;
    DMA_Channel_TypeDef channels[DMA_NBR_CHANNELS];
} DMA_TypeDef;



    /**
     * @brief External Interrupt/Event Controller
     */

typedef struct {
    uint32_t IMR;
    uint32_t EMR;
    uint32_t RTSR;
    uint32_t FTSR;
    uint32_t SWIER;
    uint32_t PR;
} EXTI_TypeDef;

    /**
     * @brief Inter Integrated Circuit Interface
     */

typedef struct {
    uint32_t CR1;
    uint32_t CR2;
    uint32_t OAR1;
    uint32_t OAR2;
    uint32_t DR;
    uint32_t SR1;
    uint32_t SR2;
    uint32_t CCR;
    uint32_t TRISE;
} I2C_TypeDef;

    /**
     * @brief TIM Timers
     */
typedef struct {
    uint32_t CR1;             /*!< TIM control register 1,                      Address offset: 0x00 */
    uint32_t CR2;             /*!< TIM control register 2,                      Address offset: 0x04 */
    uint32_t SMCR;            /*!< TIM slave Mode Control register,             Address offset: 0x08 */
    uint32_t DIER;            /*!< TIM DMA/interrupt enable register,           Address offset: 0x0C */
    uint32_t SR;              /*!< TIM status register,                         Address offset: 0x10 */
    uint32_t EGR;             /*!< TIM event generation register,               Address offset: 0x14 */
    uint32_t CCMR1;           /*!< TIM  capture/compare mode register 1,        Address offset: 0x18 */
    uint32_t CCMR2;           /*!< TIM  capture/compare mode register 2,        Address offset: 0x1C */
    uint32_t CCER;            /*!< TIM capture/compare enable register,         Address offset: 0x20 */
    uint32_t CNT;             /*!< TIM counter register,                        Address offset: 0x24 */
    uint32_t PSC;             /*!< TIM prescaler register,                      Address offset: 0x28 */
    uint32_t ARR;             /*!< TIM auto-reload register,                    Address offset: 0x2C */
    uint32_t RCR;             /*!< TIM  repetition counter register,            Address offset: 0x30 */
    uint32_t CCR1;            /*!< TIM capture/compare register 1,              Address offset: 0x34 */
    uint32_t CCR2;            /*!< TIM capture/compare register 2,              Address offset: 0x38 */
    uint32_t CCR3;            /*!< TIM capture/compare register 3,              Address offset: 0x3C */
    uint32_t CCR4;            /*!< TIM capture/compare register 4,              Address offset: 0x40 */
    uint32_t BDTR;            /*!< TIM break and dead-time register,            Address offset: 0x44 */
    uint32_t DCR;             /*!< TIM DMA control register,                    Address offset: 0x48 */
    uint32_t DMAR;            /*!< TIM DMA address for full transfer register,  Address offset: 0x4C */
    uint32_t OR;              /*!< TIM option register,                         Address offset: 0x50 */
} TIM_TypeDef;
#endif

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __SAM3X8A_H */
